cf/InformationRegisters/_DemoWarehouseDocumentsRegister.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>_DemoWarehouseDocumentsRegister</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmployeeResponsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Posted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletionMark</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>RefType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StorageLocation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoStorageLocations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ref</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._DemoInventoryTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef._DemoReceivedGoodsRecording</v8:Type>
						<v8:Type>cfg:DocumentRef._DemoGoodsWriteOff</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AdditionalRecord</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/_DemoWarehouseDocumentsRegister/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.AccessManagement

// Parameters:
//   Restriction - See AccessManagementOverridable.OnFillAccessRestriction.Restriction.
//
Procedure OnFillAccessRestriction(Restriction) Export
	
	Restriction.Text =
	"AllowReadUpdate
	|WHERE
	|	ListReadingAllowed(RefType)
	|	AND ValueAllowed(Organization)
	|	AND ValueAllowed(StorageLocation)";
	
EndProcedure

// End StandardSubsystems.AccessManagement

#EndRegion

#EndRegion

#Region Private

// Parameters:
//   Document - DocumentObject
//
Procedure UpdateWarehouseDocumentsRegistry(Document) Export
	
	SetPrivilegedMode(True);
	
	If Common.IsReference(TypeOf(Document)) Then
		Ref = Document;
		
		Attributes = "Ref, DeletionMark, Posted, Date, Number, Organization, EmployeeResponsible, Comment";
		
		If TypeOf(Ref) = Type("DocumentRef._DemoInventoryTransfer") Then
			Attributes = Attributes + ", StorageSource, StorageLocationDestination";
		Else
			Attributes = Attributes + ", StorageLocation";
		EndIf;
		
		Data = Common.ObjectAttributesValues(Ref, Attributes);
		If Not ValueIsFilled(Data.Ref) Then
			Return; // The object is deleted, 1C:Enterprise deletes the linked record.
		EndIf;
	Else
		Ref = Document.Ref;
		Data = Document;
	EndIf;
	
	RecordSet = CreateRecordSet();
	RecordSet.Filter.Ref.Set(Ref);
	Record = RecordSet.Add();
	FillPropertyValues(Record, Data);
	Record.RefType = Common.MetadataObjectID(TypeOf(Record.Ref));
	
	If TypeOf(Ref) = Type("DocumentRef._DemoInventoryTransfer") Then
		Record.StorageLocation = Data.StorageSource;
		// Additional record for the transfer operation.
		SecondRecord = RecordSet.Add();
		FillPropertyValues(SecondRecord, Data);
		SecondRecord.RefType = Record.RefType;
		SecondRecord.StorageLocation = Data.StorageLocationDestination;
		SecondRecord.AdditionalRecord = True;
	EndIf;
	
	RecordSet.Write();
	
EndProcedure

#EndRegion

#EndIf
